Documents/ВводНачальныхОстатковПоЗарплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатковПоЗарплате</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоНДФЛ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоВзносамВФонды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУпрУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовСРаботниками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСтавокНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходНДФЛ</Name>
							<Comment>"Код дохода НДФЛ" или "Вид расчета взносов наФОТ"</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходВыплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатВыплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЛьготРаботниковОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛьгот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Взносы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяНалоговойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаВзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтражениеВУчете</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтатьяВаловыхРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьНалоговоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВводНачальныхОстатковПоЗарплате/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
Перем мСведенияОСчетах;
Перем мСведенияОСтатьяхЗатрат;
Перем мПустойСчет;


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Формирует запрос по шапке документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке() Экспорт
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Дата                                               	КАК Дата, 
	|	ПериодРегистрации                                  	КАК ПериодРегистрации, 
	|	ВЫБОР КОГДА Организация.ГоловнаяОрганизация = &парамПустаяОрганизация 
	|			ТОГДА Организация 
	|			ИНАЧЕ Организация.ГоловнаяОрганизация 
	|		  КОНЕЦ                                         КАК ГоловнаяОрганизация, 
	|	Организация											КАК Организация, 
	|	Организация											КАК ОбособленноеПодразделение, 
	| 	Ссылка                                              КАК Ссылка
	| 
	|	ИЗ	Документ.ВводНачальныхОстатковПоЗарплате
	| 
	|ГДЕ	Ссылка = &ДокументСсылка
	|";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// проверяет должен ли быть указан или нет счет учета по НУ
//
// Параметры
//  СчетДт,СчетКт - счета хозрасчетного плана счетов
//  СчетДтНУ	  - счет налогового плана счетов - будущий счет дебета
//
// Возвращаемое значение:
//   булево   – если сочетание корректно, то истина
//
Функция КорректноеСочетаниеСчетов(Выборка,Сообщение)
	
	Сообщение = "";
	
	СчетКт = Выборка.СчетКт;
	СчетДт = Выборка.СчетДт;
	
	Если (СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоОплатеТруда 
		или СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеФинансовыеДоходы) Тогда
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Проводки в дебет %1 не должны отражаться в налоговом учете!';uk='Проводки в дебет %1 не повинні відображатись в податковому обліку!'"), Выборка.НаименованиеСчетДт);
	КонецЕсли;
	
	Возврат НЕ ЗначениеЗаполнено(Сообщение)
	
КонецФункции // КорректноеСочетаниеСчетов()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура АвтозаполнениеПроводок() Экспорт
	
	ОтражениеВУчете.Очистить();
	Записать();  // запишем документ, чтобы обратится к нему через запрос
	
	СформироватьПроводкиНачисления();
	СформироватьПроводкиВзносы();
	СформироватьПроводкиНДФЛ();
	
КонецПроцедуры  // АвтозаполнениеПроводок

// Заполняет табличную часть РаботникиОрганизации, всеми физ лицами, которые числятся на конец периода по указанным координатам, 
// их дыижения и внутреннее совместительство 
// Всех не уволенных на конец ПериодаРасчета документа
// А за одно и создает пустые строки по табличным частям
//
Функция АвтозаполнениеРаботникиОрганизации() экспорт
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамНачало" , НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонец" , КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОрганизация" , Организация);
	Запрос.УстановитьПараметр("парамПользователь" , Ответственный);
	Запрос.УстановитьПараметр("парамПодразделение" , ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("парамВнутреннийСовместитель" , Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	
	Запрос.УстановитьПараметр("Уволен", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	
 	// Проверим ответсвенного - является ли он расчетчиком вообще и для заданного 
 	// подразделения (если оно задано)
 
 	ПустоеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	// Описание условий	
	Если ПодразделениеОрганизации = ПустоеПодразделение Тогда
		
		ПоВсемПодразделениямОрганизации = Истина;
		УсловиеНаПодразделение = "ПодразделениеОрганизации.Владелец = &парамОрганизация";
		
	Иначе
		
		ПоВсемПодразделениямОрганизации = Ложь;
		УсловиеНаПодразделение = "ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделение)";
		
	КонецЕсли;
	
	// Текст запроса: срез работников на конец месяца
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстЗапросаАвтозаполнениеРаботники = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец, Организация = &парамОрганизация) КАК Работники
		|		
		|ГДЕ 
		|	Работники.ЗанимаемыхСтавок > 0 
		|	И Работники.Сотрудник.ОсновноеНазначение = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка) 
		|	"+?(ПоВсемПодразделениямОрганизации, "", "И Работники."+УсловиеНаПодразделение)+"
		|";
	Иначе
		ТекстЗапросаАвтозаполнениеРаботники = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК Работники
		|		
		|ГДЕ 
		|	Работники.Организация = &парамОрганизация 
		|	И Работники.ДатаНачала < &парамНачало 
		|	"+?(ПоВсемПодразделениямОрганизации, "", "И Работники."+УсловиеНаПодразделение)+"
		|";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаАвтозаполнениеРаботники;
	
	РезультатЗапроса = Запрос.Выполнить();
    РаботникиОрганизации.Загрузить(РезультатЗапроса.Выгрузить());
	АвтозаполнениеСтрокиРаботникаОрганизации(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Сотрудник"));

КонецФункции // АвтозаполнениеРаботникиОрганизации()

Процедура АвтозаполнениеСтрокиРаботникаОрганизации(Сотрудники)

	// Создадим запрос и установим его параметры
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамРегистратор" , Ссылка);
	Запрос.УстановитьПараметр("парамОрганизация" , Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамСотрудник"   , Сотрудники);
	
	//	ВТВзносыПоСотрудникамПоПериодам
	Если Истина Тогда 
		//	Описание:
		// 		Все сотрудники из табличной части, их внутренние совместительства и все сотрудники которых замещали
		//		Для п.1.
		ТекстЗапроса = "
		|	ВЫБРАТЬ
		|		ВзносыПоПериодам.Сотрудник		КАК Сотрудник,
		|		ВзносыПоПериодам.Налог			КАК Налог,
		|		ВзносыПоПериодам.Период			КАК Период,
		|		ВзносыАктуальность.Актуальность	КАК Актуальность
		|ПОМЕСТИТЬ ВТВзносыПоСотрудникамПоПериодам	
		|	ИЗ	(
		|		ВЫБРАТЬ
		|			Взносы.Сотрудник			КАК Сотрудник,
		|			Взносы.Налог				КАК Налог,
		|			МАКСИМУМ( Взносы.Период )	КАК Период
		|
		|		ИЗ	РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК Взносы
		|
		|		ГДЕ		Взносы.Сотрудник в ( &парамСотрудник )
		| 			И   Взносы.Организация в ( &парамОрганизация )
		|       	И	(Взносы.Период < &ПериодРегистрации
		|           // прием на работу
		|       	ИЛИ	Взносы.Актуальность И НАЧАЛОПЕРИОДА(Взносы.Период, МЕСЯЦ) = &ПериодРегистрации)
		|           // увольнение с работы
		|       	И	НЕ (НЕ Взносы.Актуальность И НАЧАЛОПЕРИОДА(Взносы.Период, МЕСЯЦ) = &ПериодРегистрации)
		|		СГРУППИРОВАТЬ ПО
		|			Взносы.Сотрудник,
		|			Взносы.Налог
		|)	КАК ВзносыПоПериодам
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ	( 
		|		ВЫБРАТЬ
		|			Взносы.Сотрудник			КАК Сотрудник,
		|			Взносы.Налог				КАК Налог,
		|			Взносы.Период				КАК Период,
		|			Взносы.Актуальность			КАК Актуальность
		|
		|		ИЗ	РегистрСведений.ВзносыВФондыРаботниковОрганизаций КАК Взносы
		|
		|		ГДЕ		Взносы.Сотрудник в ( &парамСотрудник )
		| 			И   Взносы.Организация в ( &парамОрганизация )
		|       	И	НАЧАЛОПЕРИОДА(Взносы.Период, МЕСЯЦ) <= &ПериодРегистрации
		
		| )	КАК ВзносыАктуальность
		|	ПО		ВзносыАктуальность.Сотрудник	= ВзносыПоПериодам.Сотрудник
		|		И	ВзносыАктуальность.Налог		= ВзносыПоПериодам.Налог
		|		И	ВзносыАктуальность.Период		= ВзносыПоПериодам.Период
		|
		|	ГДЕ ВзносыАктуальность.Актуальность
		|
		|";
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТВзносыПоСотрудникамПоПериодам";
	
	ТекстЗапроса = "
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Работники.Сотрудник								КАК Сотрудник,
	|	СведенияОВзносах.Налог							КАК Налог,
	|	Параметры.СчетУчета								КАК СчетУчета,
	|	ШкалаСтавокНалогов.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации
	|
	|ИЗ	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПериодРегистрации, Организация в (&парамОрганизация)) КАК Работники
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТВзносыПоСотрудникамПоПериодам КАК СведенияОВзносах
	| ПО    СведенияОВзносах.Сотрудник	=	Работники.Сотрудник
	//|		И &ПериодРегистрации	>=	СведенияОВзносах.Период
	|				
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(&ПериодРегистрации,НомерПорога = ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.Порог1)) КАК ШкалаСтавокНалогов
	|	ПО	ШкалаСтавокНалогов.Налог	=	СведенияОВзносах.Налог
	|	И	ШкалаСтавокНалогов.НомерПорога	= ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.Порог1)
	|				
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыПлатежныхДокументовПоВзносамВФонды КАК Параметры
	|ПО Работники.Организация = Параметры.Организация
	|И (ШкалаСтавокНалогов.СтатьяНалоговойДекларации.Родитель = Параметры.СтатьяНалоговойдекларации
	|   ИЛИ ШкалаСтавокНалогов.СтатьяНалоговойдекларации = """" И Параметры.СтатьяНалоговойдекларации = &пустаяСтатьяНалоговойдекларации)
	|				
	|ГДЕ Работники.Сотрудник в (&парамСотрудник)	            
	|				
	|ИТОГИ ПО Сотрудник
	|				
	|";
	
	Запрос.УстановитьПараметр("парамПустаяДата"  , Дата('00010101'));
	Запрос.УстановитьПараметр("пустаяСтатьяНалоговойдекларации", Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка());
	Запрос.Текст = ТекстЗапроса;
	ВыборкаСотрудник = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сотрудник");
	
	Код01 = Справочники.ВидыДоходовНДФЛ.Код01;
	ВидСтавкиОсновная = Перечисления.ВидыСтавокНДФЛ.Основная;
	
	Пока ВыборкаСотрудник.Следующий() Цикл
		
		// Начисления
		НоваяСтрока = Начисления.Добавить();
		НоваяСтрока.Сотрудник			= ВыборкаСотрудник.Сотрудник;
		НоваяСтрока.БазовыйПериодНачало	= ПериодРегистрации;
		НоваяСтрока.Счет				= ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате;
		
		// НФДЛ         
		НоваяСтрока = НДФЛ.Добавить();
		НоваяСтрока.Сотрудник			= ВыборкаСотрудник.Сотрудник;
		НоваяСтрока.ВидСтавки           = ВидСтавкиОсновная;
		НоваяСтрока.ДоходНДФЛ           = Код01;
		НоваяСтрока.БазовыйПериодНачало	= ПериодРегистрации;
		НоваяСтрока.Счет				= ПланыСчетов.Хозрасчетный.РасчетыПоНДФЛ;
		
	КонецЦикла;
	
	ВыборкаВзносы = Запрос.Выполнить().Выгрузить();
	ВыборкаВзносы.Свернуть("Налог,СчетУчета,СтатьяНалоговойДекларации");
	ВыборкаВзносы.Сортировать("СчетУчета");
	Для Каждого Взнос из ВыборкаВзносы Цикл
		Если Взнос.Налог = NULL Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Взносы.Добавить();
		НоваяСтрока.Налог						= Взнос.Налог;
		НоваяСтрока.СтатьяНалоговойДекларации	= Взнос.СтатьяНалоговойДекларации;
		НоваяСтрока.Счет						= Взнос.СчетУчета;
		НоваяСтрока.БазовыйПериодНачало			= ПериодРегистрации;

	КонецЦикла;	
	
КонецПроцедуры // АвтозаполнениеВзносы



///////////////////////////////////////////////////////////////////////////
// общие функции для всех Автозаполнений

Функция ДобавитьСтрокуВПроводкиНачисления(ДанныеУчета)
	
	СтрокаДанных = ОтражениеВУчете.Добавить();
	
	// ресурсы
	СтрокаДанных.Сумма			= ДанныеУчета.Сумма;
	
	// реквизиты
	СтрокаДанных.СчетДт      = ПланыСчетов.Хозрасчетный.Вспомогательный;
	
	СтрокаДанных.СчетКт      = ДанныеУчета.Счет;
	СтрокаДанных.СубконтоКт1 = ДанныеУчета.Сотрудник.ФизЛицо;
	
	Возврат СтрокаДанных;
	
КонецФункции     // ДобавитьСтрокуВПроводкиНачисления()

Функция ДобавитьСтрокуВПроводкиВзносы(ДанныеУчета)
	
	СтрокаДанных = ОтражениеВУчете.Добавить();
	
	// ресурсы
	СтрокаДанных.Сумма			= ДанныеУчета.Сумма;
	
	// реквизиты
	СтрокаДанных.СчетДт      = ПланыСчетов.Хозрасчетный.Вспомогательный;
	
	СтрокаДанных.СчетКт      = ДанныеУчета.СчетКт;
	СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1;
	СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2;
	
	Возврат СтрокаДанных;
	
КонецФункции     // ДобавитьСтрокуВПроводкиНачисления()

Функция ДобавитьСтрокуВПроводкиНДФЛ(ДанныеУчета)
	
	СтрокаДанных = ОтражениеВУчете.Добавить();
	
	// ресурсы
	СтрокаДанных.Сумма			= ДанныеУчета.Сумма;
	
	// реквизиты
	СтрокаДанных.СчетДт      = ПланыСчетов.Хозрасчетный.Вспомогательный;
	
	СтрокаДанных.СчетКт      = ДанныеУчета.СчетКт;
	
	Возврат СтрокаДанных;
	
КонецФункции     // ДобавитьСтрокуВПроводкиНачисления()


///////////////////////////////////////////////////////////////////////////
// Автозаполнения





////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура СформироватьПроводкиНачисления()
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса  = "
	|ВЫБРАТЬ
	|	Основные.Счет						КАК Счет,
	|	Основные.Сотрудник					КАК Сотрудник,
	|	СУММА(Основные.Результат)			КАК Сумма
	|	
	|ИЗ	Документ.ВводНачальныхОстатковПоЗарплате.Начисления КАК Основные
	|ГДЕ Основные.Ссылка = &парамРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Основные.Счет,
	|	Основные.Сотрудник
	|
	|";
	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	
	ВыборкаПоПроводкам = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПоПроводкам.Следующий() Цикл
		
		Если ВыборкаПоПроводкам.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьСтрокуВПроводкиНачисления(ВыборкаПоПроводкам);
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗапросПроводкиНачисления()

Процедура СформироватьПроводкиВзносы()
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса  = "
	|ВЫБРАТЬ
	|	Основные.Счет						КАК СчетКт,
	|	Основные.Налог						КАК СубконтоКт1,
	|	Основные.СтатьяНалоговойДекларации	КАК СубконтоКт2,
	|	СУММА(Основные.Результат)			КАК Сумма
	|	
	|ИЗ	Документ.ВводНачальныхОстатковПоЗарплате.Взносы КАК Основные
	|ГДЕ Основные.Ссылка = &парамРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Основные.Счет,
	|	Основные.Налог,
	|	Основные.СтатьяНалоговойДекларации
	|
	|";
	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	
	ВыборкаПоПроводкам = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПоПроводкам.Следующий() Цикл
		
		Если ВыборкаПоПроводкам.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьСтрокуВПроводкиВзносы(ВыборкаПоПроводкам);
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗапросПроводкиНачисления()

Процедура СформироватьПроводкиНДФЛ()
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса  = "
	|ВЫБРАТЬ
	|	Основные.Счет						КАК СчетКт,
	|	СУММА(Основные.Результат)			КАК Сумма
	|	
	|ИЗ	Документ.ВводНачальныхОстатковПоЗарплате.НДФЛ КАК Основные
	|ГДЕ Основные.Ссылка = &парамРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Основные.Счет
	|
	|";
	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	
	ВыборкаПоПроводкам = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПоПроводкам.Следующий() Цикл
		
		Если ВыборкаПоПроводкам.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьСтрокуВПроводкиНДФЛ(ВыборкаПоПроводкам);
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗапросПроводкиНачисления()

Функция СформироватьЗапросПоОтражениюВУчете()
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОтражениеЗарплаты.НомерСтроки				КАК НомерСтроки,
	|	ВЫБОР	КОГДА ОтражениеЗарплаты.СубконтоДт1 ССЫЛКА Справочник.ПодразделенияОрганизаций 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт1 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт2 ССЫЛКА Справочник.ПодразделенияОрганизаций 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт2 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт3 ССЫЛКА Справочник.ПодразделенияОрганизаций 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт3 
	|			ИНАЧЕ &ПустоеПодразделение 
	|	КОНЕЦ 	КАК ПодразделениеОрганизации,
	|
	|	ВЫБОР	КОГДА ОтражениеЗарплаты.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт1 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт2 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт3 
	|			ИНАЧЕ &ПустаяСтатьяЗатрат 
	|	КОНЕЦ 	КАК СтатьяЗатрат,
	|
	|	ВЫБОР	КОГДА ОтражениеЗарплаты.СубконтоДт1 ССЫЛКА Справочник.НоменклатурныеГруппы 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт1 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт2 ССЫЛКА Справочник.НоменклатурныеГруппы 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт2 
	|			КОГДА ОтражениеЗарплаты.СубконтоДт3 ССЫЛКА Справочник.НоменклатурныеГруппы 
	|				ТОГДА ОтражениеЗарплаты.СубконтоДт3 
	|			ИНАЧЕ &ПустаяНоменклатурнаяГруппа 
	|	КОНЕЦ	КАК НоменклатурнаяГруппа,
	|
	|	ОтражениеЗарплаты.СчетДт				КАК СчетДт,
	|	ОтражениеЗарплаты.СчетДт.Наименование	КАК НаименованиеСчетДт,
	|	ОтражениеЗарплаты.СубконтоДт1			КАК СубконтоДт1,
	|	ОтражениеЗарплаты.СубконтоДт2			КАК СубконтоДт2,
	|	ОтражениеЗарплаты.СубконтоДт3			КАК СубконтоДт3,
	|	ВидСубконтоДт1.ВидСубконто				КАК ВидСубконтоДт1,
	|	ВидСубконтоДт2.ВидСубконто 				КАК ВидСубконтоДт2,
	|	ВидСубконтоДт3.ВидСубконто 				КАК ВидСубконтоДт3,
	|
	|	ОтражениеЗарплаты.СчетКт				КАК СчетКт,
	|	ОтражениеЗарплаты.СубконтоКт1			КАК СубконтоКт1,
	|	ОтражениеЗарплаты.СубконтоКт2			КАК СубконтоКт2,
	|	ОтражениеЗарплаты.СубконтоКт3			КАК СубконтоКт3,
	|	ВидСубконтоКт1.ВидСубконто 				КАК ВидСубконтоКт1,
	|	ВидСубконтоКт2.ВидСубконто 				КАК ВидСубконтоКт2,
	|	ВидСубконтоКт3.ВидСубконто 				КАК ВидСубконтоКт3,
	|
	|	ОтражениеЗарплаты.Сумма					КАК Сумма
	|
	|ИЗ	Документ.ВводНачальныхОстатковПоЗарплате.ОтражениеВУчете КАК ОтражениеЗарплаты
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоДт1
	|ПО ВидСубконтоДт1.Ссылка = ОтражениеЗарплаты.СчетДт И (ВидСубконтоДт1.НомерСтроки = 1)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоДт2
	|ПО ВидСубконтоДт2.Ссылка = ОтражениеЗарплаты.СчетДт И (ВидСубконтоДт2.НомерСтроки = 2)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоДт3
	|ПО ВидСубконтоДт3.Ссылка = ОтражениеЗарплаты.СчетДт И (ВидСубконтоДт3.НомерСтроки = 3)
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоКт1
	|ПО ВидСубконтоКт1.Ссылка = ОтражениеЗарплаты.СчетКт И (ВидСубконтоКт1.НомерСтроки = 1)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоКт2
	|ПО ВидСубконтоКт2.Ссылка = ОтражениеЗарплаты.СчетКт И (ВидСубконтоКт2.НомерСтроки = 2)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоКт3
	|ПО ВидСубконтоКт3.Ссылка = ОтражениеЗарплаты.СчетКт И (ВидСубконтоКт3.НомерСтроки = 3)
	|
	|
	|ГДЕ	ОтражениеЗарплаты.Ссылка = &парамРегистратор
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Запрос.УстановитьПараметр("РасходыБудущихПериодов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяНоменклатурнаяГруппа", Справочники.НоменклатурныеГруппы.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ПустаяСсылка());
	
	Возврат Запрос.Выполнить();
	
КонецФункции  // СформироватьЗапросПоОтражениюВУчете()



// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(Отказ, НеПроверятьОрганизацию = Ложь);
	
	Если НЕ ЗначениеЗаполнено(Организация) И Не НеПроверятьОрганизацию Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не задана организация!';uk='Не задана організація!'"), Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не задан период за который выполняется отражение начислений в бухгалтерском учете!';uk='Не заданий період за який виконується відображення нарахувань у бухгалтерському обліку!'"), Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()


Процедура ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоДоходам, Отказ, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табл. части ""Проводки"": ';uk='У рядку номер ""%1"" табл. частини ""Проводки"": '"), СокрЛП(ВыборкаПоДоходам.НомерСтроки));
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.СчетДт) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='Не указан счет дебета!';uk='Не зазначений рахунок дебету!'"), Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.СчетКт) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='Не указан счет кредита!';uk='Не зазначений рахунок кредиту!'"), Отказ);
	КонецЕсли;
	
	Сообщение = "";
	Если Не КорректноеСочетаниеСчетов(ВыборкаПоДоходам,Сообщение) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + Сообщение, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиОтраженияВУчете()

Процедура ДобавитьСтрокуВДвиженияПоОтражениюВУчете(СтруктураШапкиДокумента, ВыборкаПоДоходам, ВалютаРеглУчета)
	
	Если ВыборкаПоДоходам.Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// проводка по бухгалтерскому регистру
	Проводка = Движения.Хозрасчетный.Добавить();
	
	Проводка.Активность = Истина;
	Проводка.Период     = СтруктураШапкиДокумента.Дата;
	
	Проводка.Организация	= Организация;
	Проводка.Сумма			= ВыборкаПоДоходам.Сумма;
	Проводка.НомерЖурнала	= "ЗП";
	
	// бухучет
	Проводка.СчетДт       = ВыборкаПоДоходам.СчетДт;
	Проводка.СчетКт       = ВыборкаПоДоходам.СчетКт;
	Проводка.СубконтоДт[ВыборкаПоДоходам.ВидСубконтоДт1] = ВыборкаПоДоходам.СубконтоДт1;
	Проводка.СубконтоДт[ВыборкаПоДоходам.ВидСубконтоДт2] = ВыборкаПоДоходам.СубконтоДт2;
	Проводка.СубконтоДт[ВыборкаПоДоходам.ВидСубконтоДт3] = ВыборкаПоДоходам.СубконтоДт3;
	Проводка.СубконтоКт[ВыборкаПоДоходам.ВидСубконтоКт1] = ВыборкаПоДоходам.СубконтоКт1;
	Проводка.СубконтоКт[ВыборкаПоДоходам.ВидСубконтоКт2] = ВыборкаПоДоходам.СубконтоКт2;
	Проводка.СубконтоКт[ВыборкаПоДоходам.ВидСубконтоКт3] = ВыборкаПоДоходам.СубконтоКт3;
	
	ЕстьЗатраты = ВыборкаПоДоходам.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат,"ВидСубконто") <> Неопределено;
	
КонецПроцедуры  // ДобавитьСтрокуВДвиженияПоОтражениюВУчете()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//  Формирует движения по взаиморасчетам с работниками
//
// Параметры:
//		ВыборкаПоШапкеДокумента - спозиционированная выборка по шапке документа
//		НаборЗаписей - набор записей 
//      Перерасчет - признак проведения перерасчетов, по умолчанию - Ложь
//      Физлица - список физлиц, по которым производится расчет, по умолчанию - отсутствует
//
// Возвращаемое значение:
//  Нет.
//		
Процедура СформироватьОстаткиВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, НаборЗаписей )
	
	Запрос = Новый Запрос();
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка"  , Ссылка);
	
	ТекстЗапроса = "
	|	ВЫБРАТЬ     
	|		Основные.Сотрудник 					КАК Сотрудник,
	|		Основные.Счет 						КАК Счет,
	|		Основные.БазовыйПериодНачало 		КАК БазовыйПериодНачало,
	|		СУММА(Основные.Результат) 			КАК Сумма
	|
	|	ИЗ	Документ.ВводНачальныхОстатковПоЗарплате.Начисления КАК Основные
	|	ГДЕ	  Основные.Ссылка = &парамСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|		Основные.Сотрудник,
	|		Основные.Счет,
	|		Основные.БазовыйПериодНачало
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	Доходы = Запрос.Выполнить().Выбрать();
	// сформируем движения ВзаиморасчетыСРаботникамиОрганизаций
	Пока Доходы.Следующий() Цикл
		
		Если Доходы.Сумма = 0  Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = НаборЗаписей.Добавить();
		
		// свойства                              
		Движение.Период 				= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		
		// измерения 
		Движение.Сотрудник 				= Доходы.Сотрудник;
		Движение.Организация 			= ВыборкаПоШапкеДокумента.Организация;          
		Движение.ПериодВзаиморасчетов 	= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Движение.СчетУчета				= Доходы.Счет;
		
		Движение.КодОперации			= Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Начисления;

		СтруктураКурса = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Валюта", глЗначениеПеременной("ВалютаУправленческогоУчета")));
		мКурс = СтруктураКурса.Курс*СтруктураКурса.Кратность;
		// ресурсы
		Если ОтражатьВРеглУчете И Не ОтражатьВУпрУчете Тогда
			Движение.СуммаВзаиморасчетов 	= Доходы.Сумма;
		ИначеЕсли ОтражатьВУпрУчете И Не ОтражатьВРеглУчете Тогда
			Движение.СуммаВзаиморасчетовУпр 	= Доходы.Сумма;
		Иначе
			Движение.СуммаВзаиморасчетов 	= Доходы.Сумма;
			Движение.СуммаВзаиморасчетовУпр = ?(мКурс = 0, 0, Доходы.Сумма/мКурс);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры   // СформироватьОстаткиВзаиморасчетыСРаботниками

Процедура СформироватьОстаткиВзаиморасчетыПоВзносамВФонды( ВыборкаПоШапкеДокумента, НаборЗаписей )
	
	Запрос = Новый Запрос();
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка"  , Ссылка);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ                          
	|	Доходы.СтатьяНалоговойДекларации    КАК СтатьяНалоговойДекларации,
	|	Доходы.БазовыйПериодНачало        	КАК БазовыйПериодНачало,
	|	Доходы.Налог        				КАК Налог,
	|	СУММА(Доходы.БазаВзноса)     		КАК База,
	|	СУММА(Доходы.БазаВзноса) 			КАК БазаВзноса,
	|	СУММА(Доходы.Результат) 			КАК Результат
	|	
	|	ИЗ	Документ.ВводНачальныхОстатковПоЗарплате.Взносы КАК Доходы
	|	ГДЕ   Доходы.Ссылка = &парамСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.СтатьяНалоговойДекларации,
	|	Доходы.БазовыйПериодНачало,
	|	Доходы.Налог
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Доходы = Запрос.Выполнить().Выбрать();
	
	// сформируем движения ВзаиморасчетыСРаботникамиОрганизаций
	Пока Доходы.Следующий() Цикл
		
		Если Доходы.БазаВзноса = 0 И Доходы.Результат  = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Доходы.СтатьяНалоговойДекларации = Неопределено
			ИЛИ Доходы.СтатьяНалоговойДекларации  = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка()
			Тогда
			Продолжить;
		КонецЕсли; 
		
		Движение = НаборЗаписей.Добавить();
		
		// свойства                              
		Движение.Период 				= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		
		// измерения 
		Движение.Организация 			= Организация; 
		
		Движение.СтатьяНалоговойДекларации  = Доходы.СтатьяНалоговойДекларации;
		Движение.ПериодВзаиморасчетов		= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Движение.Налог						= Доходы.Налог;
		
		// ресурсы
		Движение.База		= Доходы.БазаВзноса;
		Движение.БазаВзноса	= Доходы.БазаВзноса;
		Движение.Результат	= Доходы.Результат;
		
	КонецЦикла;
	
КонецПроцедуры   // СформироватьОстаткиВзаиморасчетыПоВзносамВФонды

Процедура СформироватьОстаткиВзаиморасчетыПоНДФЛ( ВыборкаПоШапкеДокумента ) Экспорт
	
	// Создадим запрос и установим параметры запроса
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтрокиНДФЛ.Сотрудник,
	|	СтрокиНДФЛ.БазовыйПериодНачало,
	|	СтрокиНДФЛ.ДоходНДФЛ,
	|	СтрокиНДФЛ.ВидСтавки,
	|	СтрокиНДФЛ.Льгота,
	|	СтрокиНДФЛ.КоличествоЛьгот,
	|	СУММА(СтрокиНДФЛ.Доход) КАК Доход,
	|	СУММА(СтрокиНДФЛ.Результат) КАК Налог,
	|	СУММА(СтрокиНДФЛ.ДоходВыплата) КАК ДоходВыплата,
	|	СУММА(СтрокиНДФЛ.РезультатВыплата) КАК НалогВыплата
	|ИЗ
	|	Документ.ВводНачальныхОстатковПоЗарплате.НДФЛ КАК СтрокиНДФЛ
	|
	|ГДЕ  СтрокиНДФЛ.Ссылка  = &парамРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиНДФЛ.Сотрудник,
	|	СтрокиНДФЛ.БазовыйПериодНачало,
	|	СтрокиНДФЛ.ДоходНДФЛ,
	|	СтрокиНДФЛ.ВидСтавки,
	|	СтрокиНДФЛ.Льгота,
	|	СтрокиНДФЛ.КоличествоЛьгот
	|";
	
	ВыборкаПоСтрокамДокумента = Запрос.Выполнить().Выбрать();
	
	СтруктураКурса = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(ПериодРегистрации, Новый Структура("Валюта", глЗначениеПеременной("ВалютаУправленческогоУчета")));
	мКурс = СтруктураКурса.Курс*СтруктураКурса.Кратность;
	
	// сформируем движения ВзаиморасчетыСРаботникамиОрганизаций
	Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
		
		Если ВыборкаПоСтрокамДокумента.Налог <> 0 ИЛИ ВыборкаПоСтрокамДокумента.Доход <> 0 Тогда
			Движение = Движения.ВзаиморасчетыПоНДФЛ.Добавить();
			
			Движение.Период			= НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
			
			// Измерения
			Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
			
			Движение.НалоговыйПериод 	= НачалоМесяца(ВыборкаПоСтрокамДокумента.БазовыйПериодНачало); 

			// если это переасчет, то путь он ляжет на поледний месяц периода
			Движение.ПериодВзаиморасчетов	= ВыборкаПоСтрокамДокумента.БазовыйПериодНачало;
			Движение.ДоходНДФЛ			= ВыборкаПоСтрокамДокумента.ДоходНДФЛ;
			Движение.ВидСтавки			= ВыборкаПоСтрокамДокумента.ВидСтавки;
			Движение.Льгота				= ВыборкаПоСтрокамДокумента.Льгота;
			
			// Ресурсы
			Движение.Налог		= ВыборкаПоСтрокамДокумента.Налог;
			Движение.Доход		= ВыборкаПоСтрокамДокумента.Доход;
			Если ОтражатьВРеглУчете И ОтражатьВУпрУчете Тогда
				Движение.НалогУпр = ?(мКурс = 0, 0, ВыборкаПоСтрокамДокумента.Налог/мКурс);
			КонецЕсли;
			
			// Реквизиты 
			Движение.КоличествоЛьгот = ВыборкаПоСтрокамДокумента.КоличествоЛьгот;
			
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.НалогВыплата <> 0 ИЛИ ВыборкаПоСтрокамДокумента.ДоходВыплата <> 0 Тогда
			Движение = Движения.ВзаиморасчетыПоНДФЛ.Добавить();
			
			Движение.Период			= НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
			
			// Измерения
			Движение.Сотрудник		= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
			
			// если это переасчет, то путь он ляжет на поледний месяц периода
			Движение.ПериодВзаиморасчетов	= ВыборкаПоСтрокамДокумента.БазовыйПериодНачало;
			Движение.ДоходНДФЛ			= ВыборкаПоСтрокамДокумента.ДоходНДФЛ;
			Движение.ВидСтавки			= ВыборкаПоСтрокамДокумента.ВидСтавки;
			Движение.Льгота				= ВыборкаПоСтрокамДокумента.Льгота;
			
			// Ресурсы
			Движение.Налог		= ВыборкаПоСтрокамДокумента.НалогВыплата;
			Движение.Доход		= ВыборкаПоСтрокамДокумента.ДоходВыплата;
			Если ОтражатьВРеглУчете И ОтражатьВУпрУчете Тогда
				Движение.НалогУпр = ?(мКурс = 0, 0, ВыборкаПоСтрокамДокумента.Налог/мКурс);
			КонецЕсли;
			
			// Реквизиты 
			Движение.КоличествоЛьгот = ВыборкаПоСтрокамДокумента.КоличествоЛьгот;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьОстаткиВзаиморасчетыПоНДФЛ()



Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	Если ОтражатьВУпрУчете И НЕ ОтражатьВРеглУчете И НЕ ЗначениеЗаполнено(Организация) Тогда
		НеПроверятьОрганизацию = Истина;
	Иначе
		// Получим данные учетной политики
		СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ЕстьНалогНаПрибыль");
		ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал",СтруктураПолейУчетнойПолитикиНУ);
		НеПроверятьОрганизацию = Ложь;
	КонецЕсли;
	
		
	// При получении учетной политики произошли ошибки
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	ПроверитьЗаполнениеШапки(Отказ, НеПроверятьОрганизацию);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоОтражениюВУчете = СформироватьЗапросПоОтражениюВУчете().Выбрать();
	ВалютаРеглУчета  = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Пока ВыборкаПоОтражениюВУчете.Следующий() Цикл
		
		ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоОтражениюВУчете, Отказ, Заголовок);
		
		Если Не Отказ Тогда
			ДобавитьСтрокуВДвиженияПоОтражениюВУчете(СтруктураШапкиДокумента, ВыборкаПоОтражениюВУчете, ВалютаРеглУчета);
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
	
	////////////////////////////////////////////////////////////////////////
	// взаиморасчеты с работниками
	
	// сформируем начисления к выплате по начислениям документа
	СформироватьОстаткиВзаиморасчетыСРаботниками(СтруктураШапкиДокумента, Движения.ВзаиморасчетыСРаботникамиОрганизаций );
	
	////////////////////////////////////////////////////////////////////////
	// Взаиморасчеты с бюджетом по взносам в фонды
	СформироватьОстаткиВзаиморасчетыПоВзносамВФонды( СтруктураШапкиДокумента, Движения.ВзаиморасчетыПоВзносамВФонды );
	
	//////////////////////////////////////////////////////////////////////////
	//// НДФЛ
	// получим реквизиты табличной части
	СформироватьОстаткиВзаиморасчетыПоНДФЛ( СтруктураШапкиДокумента );
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

мПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
мСведенияОСчетах = Новый Соответствие;
мСведенияОСтатьяхЗатрат = Новый Соответствие;
